# GetCustomObjectWallHoleGroup

## Description
Access the handle to wall hole group. This group contains geometry that defines the opening that will be cut into the wall for this parametric object.

```pascal
FUNCTION GetCustomObjectWallHoleGroup(objectHand : HANDLE) : HANDLE;
```

```python

def vs.GetCustomObjectWallHoleGroup(objectHand):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|objectHand|HANDLE|Handle to custom object.|

## Returns
Returns a HANDLE to the wall hole group.

## Version
Availability: from Vectorworks 2009
## Category
* Objects - Custom